{
  "Metrics": [
    {
      "METRIC-LABEL": "MAI-COM-B1",
      "METRIC": "Routine component maintenance and configuration changes will require a total of no more than four hours user detectable outage per month."
    },
    {
      "METRIC-LABEL": "MAI-COM-B2",
      "METRIC": "System upgrades will require a total of no more than eight hours maintenance outage per calendar quarter."
    },
    {
      "METRIC-LABEL": "MAI-COM-B3",
      "METRIC": "Valid support contracts will exist for all vendor provided components."
    },
    {
      "METRIC-LABEL": "MAI-COM-C1",
      "METRIC": "System must have defined and published maintenance windows."
    },
    {
      "METRIC-LABEL": "MAI-COM-D1",
      "METRIC": "No data loss will occur during maintenance operations."
    },
    {
      "METRIC-LABEL": "REC-COM-A1",
      "METRIC": "During recovery, the user detectable loss of business functionality will be no more than 60 seconds.",
      "REPLACES": "REC-COM-B1"
    },
    {
      "METRIC-LABEL": "REC-COM-A2",
      "METRIC": "During component recovery, business functionality will be available to the user without re-authentication or loss of context. "
    },
    {
      "METRIC-LABEL": "REC-COM-A3",
      "METRIC": "During component recovery, the system will continue to meet all Non-Functional Requirements other than Resiliency Requirements"
    },
    {
      "METRIC-LABEL": "REC-COM-B1",
      "METRIC": "During recovery, the user detectable loss of business functionality will be no more than four business hours.",
      "REPLACEDBY": "REC-COM-A1"
    },
    {
      "METRIC-LABEL": "REC-COM-C1",
      "METRIC": "The component shall be recoverable within one business day."
    },
    {
      "METRIC-LABEL": "REC-COM-C2",
      "METRIC": "During recovery, no data modifications will be lost."
    },
    {
      "METRIC-LABEL": "REC-COM-D1",
      "METRIC": "After component recovery, the system will meet all pre-failure functional and non-functional requirements."
    },
    {
      "METRIC-LABEL": "REC-COM-D2",
      "METRIC": "The system will meet System guideline 5.23.1.11, Data Backup"
    },
    {
      "METRIC-LABEL": "REC-CON-A2",
      "METRIC": "No data modifications will be lost.",
      "REPLACES": "REC-CON-B2"
    },
    {
      "METRIC-LABEL": "REC-CON-A3",
      "METRIC": "A formal process exists for determining the root cause of a failed configuration modification."
    },
    {
      "METRIC-LABEL": "REC-CON-B1",
      "METRIC": "The user detectable loss of business functionality will be an elapsed time of no more than one business day."
    },
    {
      "METRIC-LABEL": "REC-CON-B2",
      "METRIC": "No more than the most recent fifteen minutes of data modifications will be lost.",
      "REPLACES": "REC-CON-D1",
      "REPLACEDBY": "REC-CON-A2"
    },
    {
      "METRIC-LABEL": "REC-CON-B3",
      "METRIC": "A formal process exists for review and testing of configuration modifications."
    },
    {
      "METRIC-LABEL": "REC-CON-D1",
      "METRIC": "No more than one business day of data modifications will be lost.",
      "REPLACEDBY": "REC-CON-B2"
    },
    {
      "METRIC-LABEL": "REC-CON-D2",
      "METRIC": "The recovered system will meet pre-failure functional and non-functional requirements"
    },
    {
      "METRIC-LABEL": "REC-LOG-A1",
      "METRIC": "No more than the most recent one hour of data modifications will be lost.",
      "REPLACES": "REC-LOG-B2"
    },
    {
      "METRIC-LABEL": "REC-LOG-B1",
      "METRIC": "The user detectable loss of business functionality will be an elapsed time of no more than one business day."
    },
    {
      "METRIC-LABEL": "REC-LOG-B2",
      "METRIC": "No more than the most recent one business day of data modifications will be lost.",
      "REPLACEDBY": "REC-LOG-A1"
    },
    {
      "METRIC-LABEL": "REC-LOG-C1",
      "METRIC": "The system must have defined and published recovery point and recovery time objectives."
    },
    {
      "METRIC-LABEL": "REC-LOG-D1",
      "METRIC": "The recovered system will meet all pre-failure functional and non-functional requirements."
    },
    {
      "METRIC-LABEL": "REC-SIT-A1",
      "METRIC": "The user detectable loss of functionality will be for an elapsed time of no more than one business day.  ",
      "REPLACES": "REC-SIT-B1"
    },
    {
      "METRIC-LABEL": "REC-SIT-A2",
      "METRIC": "No more than the most recent thirty minutes of data modifications will be lost. ",
      "REPLACES": "REC-SIT-B2"
    },
    {
      "METRIC-LABEL": "REC-SIT-A3",
      "METRIC": "The system at the alternate site will meet all pre-failure non-functional requirements other than site recoverability. ",
      "REPLACES": "REC-SIT-B3"
    },
    {
      "METRIC-LABEL": "REC-SIT-B1",
      "METRIC": "The user detectable loss of business functionality will be an elapsed time of no more than five business days.  ",
      "REPLACES": "REC-SIT-C1",
      "REPLACEDBY": "REC-SIT-A1"
    },
    {
      "METRIC-LABEL": "REC-SIT-B2",
      "METRIC": "No more than the most recent one business day of data modifications will be lost. ",
      "REPLACES": "REC-SIT-C2",
      "REPLACEDBY": "REC-SIT-A2"
    },
    {
      "METRIC-LABEL": "REC-SIT-B3",
      "METRIC": "The system at the alternate site will meet all pre-failure non-functional requirements other than site recoverability, resiliency and performance requirements.  ",
      "REPLACEDBY": "REC-SIT-A3"
    },
    {
      "METRIC-LABEL": "REC-SIT-B4",
      "METRIC": "The recoverability will be tested annually.  "
    },
    {
      "METRIC-LABEL": "REC-SIT-C1",
      "METRIC": "The user detectable loss of business functionality will be an elapsed time of no more than fifteen business days.  ",
      "REPLACEDBY": "REC-SIT-B1"
    },
    {
      "METRIC-LABEL": "REC-SIT-C2",
      "METRIC": "No more than the most recent five business days of data modification will be lost.",
      "REPLACEDBY": "REC-SIT-B2"
    },
    {
      "METRIC-LABEL": "REC-SIT-C3",
      "METRIC": "The system at the alternate site will meet all pre-failure functional requirements."
    },
    {
      "METRIC-LABEL": "REC-SIT-C4",
      "METRIC": "The system at the alternate site will meet all pre-failure non-functional requirements other than site recoverability, resiliency and performance requirements."
    },
    {
      "METRIC-LABEL": "REC-SIT-D1",
      "METRIC": "The system will meet System guideline 5.23.1.11, Data Backup"
    },
    {
      "METRIC-LABEL": "RES-ENV-A4",
      "METRIC": "There will be no data loss",
      "REPLACES": "RES-ENV-B2"
    },
    {
      "METRIC-LABEL": "RES-ENV-B1",
      "METRIC": "The user detectable loss of business functionality will be an elapsed time of no more than one business day. "
    },
    {
      "METRIC-LABEL": "RES-ENV-B2",
      "METRIC": "No more than the most recent one business day of transactions will be lost.  ",
      "REPLACEDBY": "RES-ENV-A4"
    },
    {
      "METRIC-LABEL": "RES-HAR-B1",
      "METRIC": "The user detectable loss of business functionality will be no more than ten minutes",
      "REPLACES": "RES-HAR-C1"
    },
    {
      "METRIC-LABEL": "RES-HAR-B2",
      "METRIC": "No more than the single most recent in-flight transaction will be lost",
      "REPLACES": "RES-HAR-C2"
    },
    {
      "METRIC-LABEL": "RES-HAR-B3",
      "METRIC": "Business functionality will be available to the user after re-authentication"
    },
    {
      "METRIC-LABEL": "RES-HAR-B4",
      "METRIC": "The system will continue to meet non-functional requirements other than resiliency requirements.",
      "REPLACES": "RES-HAR-D1"
    },
    {
      "METRIC-LABEL": "RES-HAR-C1",
      "METRIC": "The user detectable loss of business functionality will be no more than one business day",
      "REPLACEDBY": "RES-HAR-B1"
    },
    {
      "METRIC-LABEL": "RES-HAR-C2",
      "METRIC": "No more than the most recent one business day of data modifications will be lost",
      "REPLACES": "RES-HAR-D2",
      "REPLACEDBY": "RES-HAR-B2"
    },
    {
      "METRIC-LABEL": "RES-HAR-D1",
      "METRIC": "The recovered system will meet all pre-failure functional and non-functional requirements.",
      "REPLACEDBY": "RES-HAR-B4"
    },
    {
      "METRIC-LABEL": "RES-HAR-D2",
      "METRIC": "The system will meet System guideline 5.23.1.11, Data Backup",
      "REPLACEDBY": "RES-HAR-C2"
    },
    {
      "METRIC-LABEL": "RES-SOF-B1",
      "METRIC": "The user detectable loss of business functionality will be no more than ten minutes",
      "REPLACES": "RES-SOF-C1"
    },
    {
      "METRIC-LABEL": "RES-SOF-B2",
      "METRIC": "No more than the single most recent in-flight transaction will be lost",
      "REPLACES": "RES-SOF-C2"
    },
    {
      "METRIC-LABEL": "RES-SOF-B3",
      "METRIC": "Business functionality will be available to the user after re-authentication"
    },
    {
      "METRIC-LABEL": "RES-SOF-B4",
      "METRIC": "The system will continue to meet non-functional requirements other than resiliency requirements.",
      "REPLACES": "RES-SOF-D1"
    },
    {
      "METRIC-LABEL": "RES-SOF-C1",
      "METRIC": "The user detectable loss of business functionality will be no more than one business day",
      "REPLACEDBY": "RES-SOF-B1"
    },
    {
      "METRIC-LABEL": "RES-SOF-C2",
      "METRIC": "No more than the most recent one business day of data modifications will be lost",
      "REPLACES": "RES-SOF-D2",
      "REPLACEDBY": "RES-SOF-B2"
    },
    {
      "METRIC-LABEL": "RES-SOF-D1",
      "METRIC": "The recovered system will meet all pre-failure functional and non-functional requirements.",
      "REPLACEDBY": "RES-SOF-B4"
    },
    {
      "METRIC-LABEL": "RES-SOF-D2",
      "METRIC": "The system will meet System guideline 5.23.1.11, Data Backup",
      "REPLACEDBY": "RES-SOF-C2"
    },
    {
      "METRIC-LABEL": "SCA-COM-A2",
      "METRIC": "Adding and removing capacity results in a user detectable loss of business functionality no longer than Maintainability-Component Non-Functional Requirement, Level B.",
      "REPLACES": "SCA-COM-D1"
    },
    {
      "METRIC-LABEL": "SCA-COM-D1",
      "METRIC": "Adding and removing capacity results in no user detectable loss of business functionality",
      "REPLACEDBY": "SCA-COM-A2"
    },
    {
      "METRIC-LABEL": "SEC-AWT-A1",
      "METRIC": "System administrator(s) must have, or be under the guidance of an individual, who has an applicable industry accepted certification or no less than 5 years of experience implementing, managing or maintaining a similar system."
    },
    {
      "METRIC-LABEL": "SEC-AWT-B1",
      "METRIC": "System administrator(s) must complete applicable modules from Information Security Training Program."
    },
    {
      "METRIC-LABEL": "SEC-AWT-C1",
      "METRIC": "System administrator(s) must be offered at least forty hours of job related formal training."
    },
    {
      "METRIC-LABEL": "SEC-AWT-C2",
      "METRIC": "System administrator(s) must complete Public Jobs: Private Data D2L courses; Data Security in Your Job, Securing Your Computer Workstation and Using Data in the Workplace, Data Security for Faculty, Managers and Supervisors, Managing Student Data Securely, Managing Financial Data Securely and Managing Personnel Data Securely annually.",
      "REPLACES": "SEC-AWT-D1"
    },
    {
      "METRIC-LABEL": "SEC-AWT-D1",
      "METRIC": "System administrator(s) must complete Public Jobs: Private Data D2L courses; Data Security in Your Job, Securing Your Computer Workstation and Using Data in the Workplace",
      "REPLACEDBY": "SEC-AWT-C2"
    },
    {
      "METRIC-LABEL": "SEC-CFA-A1",
      "METRIC": "An independent third party will actively verify the configuration of the system at intervals no longer than 3 years."
    },
    {
      "METRIC-LABEL": "SEC-CFA-A2",
      "METRIC": "An independent third party will actively verify the security of the application at intervals no longer than 3 years."
    },
    {
      "METRIC-LABEL": "SEC-CFA-A3",
      "METRIC": "The security of application code will be verified by automated rule based systems at intervals no longer than 365 days."
    },
    {
      "METRIC-LABEL": "SEC-CFA-A4",
      "METRIC": "The configuration of the system will be verified by automated rule based systems at intervals no longer than 7 days.  ",
      "REPLACES": "SEC-CFA-B1"
    },
    {
      "METRIC-LABEL": "SEC-CFA-B1",
      "METRIC": "The configuration of the system will be verified by automated rule based systems at intervals no longer than 30 days.",
      "REPLACES": "SEC-CFA-C1",
      "REPLACEDBY": "SEC-CFA-A4"
    },
    {
      "METRIC-LABEL": "SEC-CFA-B2",
      "METRIC": "The configuration of the system will meet CIS level 1 or equivalent and differences documented",
      "REPLACES": "SEC-CFA-C3"
    },
    {
      "METRIC-LABEL": "SEC-CFA-B3",
      "METRIC": "A formal process exists for assessing configuration modifications prior to implementation"
    },
    {
      "METRIC-LABEL": "SEC-CFA-C1",
      "METRIC": "The configuration of the system will be verified by automated rule based systems at intervals no longer than 90 days.",
      "REPLACEDBY": "SEC-CFA-B1"
    },
    {
      "METRIC-LABEL": "SEC-CFA-C2",
      "METRIC": "An automated, systematic means of mitigating software vulnerabilities must exist."
    },
    {
      "METRIC-LABEL": "SEC-CFA-C3",
      "METRIC": "The configuration of the system will meet current vendor provided standard or benchmark.",
      "REPLACES": "SEC-CFA-D1",
      "REPLACEDBY": "SEC-CFA-B2"
    },
    {
      "METRIC-LABEL": "SEC-CFA-C4",
      "METRIC": "Modification of system configuration is restricted to individuals that meet Security – System Management non-functional requirement"
    },
    {
      "METRIC-LABEL": "SEC-CFA-D1",
      "METRIC": "The configuration of the system will meet a documented standard or benchmark",
      "REPLACEDBY": "SEC-CFA-C3"
    },
    {
      "METRIC-LABEL": "SEC-CFA-D2",
      "METRIC": "The system patch intervals will meet Scale"
    },
    {
      "METRIC-LABEL": "SEC-CFI-A1",
      "METRIC": "A non-refutable log of all access and modifications to system configuration and system managed data will exist to Scale for a period of one year.",
      "REPLACES": "SEC-CFI-B1"
    },
    {
      "METRIC-LABEL": "SEC-CFI-A2",
      "METRIC": "Administrative activities that could result in the ability for a single person to commit or conceal fraud must be distributed to more than one individual."
    },
    {
      "METRIC-LABEL": "SEC-CFI-A3",
      "METRIC": "The Incident Response process in System Guideline 5.23.1.4 is tested annually.",
      "REPLACES": "SEC-CFI-D3"
    },
    {
      "METRIC-LABEL": "SEC-CFI-B1",
      "METRIC": "A non-refutable log of all access and modifications to system configuration by accounts with privileges sufficient to modify system configuration will exist to Scale for a period of one year.",
      "REPLACEDBY": "SEC-CFI-A1"
    },
    {
      "METRIC-LABEL": "SEC-CFI-B2",
      "METRIC": "No more than one business day of system modifications will be lost."
    },
    {
      "METRIC-LABEL": "SEC-CFI-B3",
      "METRIC": "Access and modification of system configuration will be conducted using privileges limited to the minimum required to complete the activity.",
      "REPLACES": "SEC-CFI-D4"
    },
    {
      "METRIC-LABEL": "SEC-CFI-D1",
      "METRIC": "The recovered system will meet all pre-modification functional and non-functional requirements."
    },
    {
      "METRIC-LABEL": "SEC-CFI-D2",
      "METRIC": "The system will meet System guideline 5.23.1.8, Anti-malware Installation and Management"
    },
    {
      "METRIC-LABEL": "SEC-CFI-D3",
      "METRIC": "A process exists that meets System Guideline 5.23.1.4, Incident Response",
      "REPLACEDBY": "SEC-CFI-A3"
    },
    {
      "METRIC-LABEL": "SEC-CFI-D4",
      "METRIC": "Systems classified as Highly Restricted or Restricted must be administered by personnel using least privilege",
      "REPLACEDBY": "SEC-CFI-B3"
    },
    {
      "METRIC-LABEL": "SEC-DAC-A1",
      "METRIC": "Multi-factor authentication is required for each individual accessing or modifying the system configuration or system managed Highly Restrictred or Restricted data.",
      "REPLACES": "SEC-DAC-B2"
    },
    {
      "METRIC-LABEL": "SEC-DAC-A2",
      "METRIC": "Individual access to the system and data is reviewed every 6 months.",
      "REPLACES": "SEC-DAC-C2"
    },
    {
      "METRIC-LABEL": "SEC-DAC-A3",
      "METRIC": "Default deny logical controls exist between all security perimeters.",
      "REPLACES": "SEC-DAC-C5"
    },
    {
      "METRIC-LABEL": "SEC-DAC-B1",
      "METRIC": "The system will maintain a non-refutable log of all access and modifications to system configuration and system managed data sufficiently to determine the individual, IP address, date/time.",
      "REPLACES": "SEC-DAC-C1"
    },
    {
      "METRIC-LABEL": "SEC-DAC-B2",
      "METRIC": "Multi-factor authentication is required for each individual accessing or modifying the system configuration.",
      "REPLACES": "SEC-DAC-D2",
      "REPLACEDBY": "SEC-DAC-A1"
    },
    {
      "METRIC-LABEL": "SEC-DAC-B3",
      "METRIC": "Tools and processes exist that detect, log and alert on unauthorized access to the system and to data managed by the system"
    },
    {
      "METRIC-LABEL": "SEC-DAC-B4",
      "METRIC": "When work assignments change, access is updated to reflect new work assignment"
    },
    {
      "METRIC-LABEL": "SEC-DAC-B5",
      "METRIC": "Access to data is based on assigned roles."
    },
    {
      "METRIC-LABEL": "SEC-DAC-B6",
      "METRIC": "Documented business or functional requirements identify the privileges required to perform all business functions that access or modify Highly Restricted or Restricted data."
    },
    {
      "METRIC-LABEL": "SEC-DAC-B7",
      "METRIC": "System accounts will conform to meet requirements defined in International Standards Organization (ISO) 27001 and 27002, section 9.4.2 - \"access to systems  and applications shall be controlled by a secure log-on procedure\", and section 9.4.3 - \"password management systems shall be interactive and shall ensure quality passwords.\""
    },
    {
      "METRIC-LABEL": "SEC-DAC-C1",
      "METRIC": "System administrator and user access and event logging is implemented",
      "REPLACEDBY": "SEC-DAC-B1"
    },
    {
      "METRIC-LABEL": "SEC-DAC-C2",
      "METRIC": "Individual access to the system and data is reviewed annually",
      "REPLACEDBY": "SEC-DAC-A2"
    },
    {
      "METRIC-LABEL": "SEC-DAC-C3",
      "METRIC": "Unique credentials are required for each individual accessing the data"
    },
    {
      "METRIC-LABEL": "SEC-DAC-C4",
      "METRIC": "A documented relationship exists between data owner and data steward"
    },
    {
      "METRIC-LABEL": "SEC-DAC-C5",
      "METRIC": "Default deny logical controls exist between lower and higher security perimeters.",
      "REPLACEDBY": "SEC-DAC-A3"
    },
    {
      "METRIC-LABEL": "SEC-DAC-D1",
      "METRIC": "A process for granting and revoking logical and physical access is implemented."
    },
    {
      "METRIC-LABEL": "SEC-DAC-D2",
      "METRIC": "Credentials used to access the system or data meet requirements defined in International Standards Organization (ISO) 27001 and 27002, section 9.4.2 - \"access to systems and applications shall be controlled by a secure log-on procedure\", and section 9.4.3 - \"password management systems shall be interactive and shall ensure quality passwords.\"",
      "REPLACEDBY": "SEC-DAC-B2"
    },
    {
      "METRIC-LABEL": "SEC-DAC-D3",
      "METRIC": "Logical and physical security perimeters are identified and documented"
    },
    {
      "METRIC-LABEL": "SEC-DAC-D4",
      "METRIC": "The systems storing or managing the data will meet requirements defined in International Standards Organization (ISO) 27001 and 27002, section 13.1.3 - \"groups of information services users and information systems shall be segregated on networks.\""
    },
    {
      "METRIC-LABEL": "SEC-DCL-A1",
      "METRIC": "Individual elements of the data managed by the system have assigned owners",
      "REPLACES": "SEC-DCL-D1"
    },
    {
      "METRIC-LABEL": "SEC-DCL-A2",
      "METRIC": "Each data element of the system has been classified to Scale",
      "REPLACES": "SEC-DCL-D2"
    },
    {
      "METRIC-LABEL": "SEC-DCL-D1",
      "METRIC": "The data managed by the system has an assigned owner",
      "REPLACEDBY": "SEC-DCL-A1"
    },
    {
      "METRIC-LABEL": "SEC-DCL-D2",
      "METRIC": "The data managed by the system has been classified to Scale",
      "REPLACEDBY": "SEC-DCL-A2"
    },
    {
      "METRIC-LABEL": "SEC-DEN-A1",
      "METRIC": "Data classified as Highly Restricted or Restricted is encrypted to Scale when stored, transported or transmitted.",
      "REPLACES": "SEC-DEN-D3"
    },
    {
      "METRIC-LABEL": "SEC-DEN-A2",
      "METRIC": "Key recovery for symmetric keys will be implemented to Scale."
    },
    {
      "METRIC-LABEL": "SEC-DEN-A3",
      "METRIC": "Credentials, other than UserID, for accounts with privileges sufficient to access or modify system data are encrypted to Scale when stored or transmitted."
    },
    {
      "METRIC-LABEL": "SEC-DEN-A4",
      "METRIC": "Credentials, other than UserID, for accounts with privileges sufficient to access or modify system configuration are encrypted to Scale when stored or transmitted."
    },
    {
      "METRIC-LABEL": "SEC-DEN-B1",
      "METRIC": "Credentials, other than UserID, for accounts with privileges sufficient to modify system configuration are encrypted to Scale when stored or transmitted."
    },
    {
      "METRIC-LABEL": "SEC-DEN-D1",
      "METRIC": "System is implemented in conformance with network segmentation policies/controls to meet requirements defined in ISO 27001 and 27002, section 13.1.3 - \"groups of information services and information systems shall be segregated on networks.\""
    },
    {
      "METRIC-LABEL": "SEC-DEN-D2",
      "METRIC": "Logical and physical security perimeters are identified and documented"
    },
    {
      "METRIC-LABEL": "SEC-DEN-D3",
      "METRIC": "Data classified as Highly Restricted or Restricted stored, transported or transmitted outside of a HIGH RISK network or perimeter is encrypted to Scale",
      "REPLACEDBY": "SEC-DEN-A1"
    }
  ]
}